// 定義各縣市與其對應的區域
const cityDistricts = {
  "臺北市": ["請選擇","中正區", "萬華區", "大同區", "中山區", "松山區", "大安區", "信義區", "內湖區", "南港區", "士林區", "北投區", "文山區"],
  "新北市": ["請選擇","板橋區","三重區","中和區","永和區","新莊區","新店區","土城區","蘆洲區","汐止區","樹林區","淡水區","三峽區","鶯歌區","瑞芳區","五股區","泰山區","林口區","深坑區","石碇區","坪林區","三芝區","石門區","八里區","平溪區","萬里區","烏來區","雙溪區","貢寮區","金山區"],
  "桃園市": ["請選擇","桃園區","八德區","大溪區","龜山區","蘆竹區","大園區","中壢區","平鎮區","龍潭區","觀音區","新屋區","楊梅區","復興區"],
  "臺中市": ["請選擇","中區","東區","南區","西區","北區","北屯區","西屯區","南屯區","太平區","大里區","霧峰區","烏日區","后里區","豐原區","潭子區","大雅區","神岡區","石岡區","東勢區","新社區","和平區","大甲區","大安區","外埔區","沙鹿區","梧棲區","清水區","龍井區","大肚區"],
  "臺南市": ["請選擇","東區","南區","中西區","北區","安平區","安南區","永康區","仁德區","歸仁區","關廟區","龍崎區","新化區","新市區","善化區","安定區","山上區","玉井區","楠西區","左鎮區","南化區","麻豆區","下營區","六甲區","官田區","大內區","佳里區","學甲區","西港區","七股區","將軍區","北門區","新營區","鹽水區","柳營區","後壁區","白河區","東山區"],
  "高雄市": ["請選擇","楠梓區","左營區","鼓山區","鹽埕區","三民區","前金區","新興區","苓雅區","前鎮區","小港區","旗津區","鳳山區","鳥松區","仁武區","大社區","大樹區","大寮區","林園區","岡山區","橋頭區","路竹區","燕巢區","阿蓮區","田寮區","梓官區","彌陀區","永安區","湖內區","茄萣區","旗山區","美濃區","內門區","杉林區","甲仙區","六龜區","那瑪夏區","桃源區","茂林區"],
  "基隆市": ["請選擇","基隆市"],
  "宜蘭縣": ["請選擇","宜蘭市","羅東鎮","蘇澳鎮","頭城鎮","礁溪鄉","壯圍鄉","員山鄉","冬山鄉","五結鄉","三星鄉","大同鄉","南澳鄉"],
  "新竹市": ["請選擇","新竹市"],
  "新竹縣": ["請選擇","竹北市","竹東鎮","新埔鎮","關西鎮","湖口鄉","新豐鄉","芎林鄉","橫山鄉","寶山鄉","北埔鄉","峨眉鄉","尖石鄉","五峰鄉"],
  "苗栗縣": ["請選擇","苗栗市","頭份市","竹南鎮","後龍鎮","通霄鎮","苑裡鎮","卓蘭鎮","造橋鄉","西湖鄉","頭屋鄉","公館鄉","銅鑼鄉","三義鄉","三灣鄉","南庄鄉","獅潭鄉","大湖鄉","泰安鄉"],
  "彰化縣": ["請選擇","彰化市","員林市","和美鎮","鹿港鎮","溪湖鎮","二林鎮","田中鎮","北斗鎮","花壇鄉","芬園鄉","大村鄉","永靖鄉","伸港鄉","線西鄉","福興鄉","秀水鄉","埔心鄉","埔鹽鄉","大城鄉","芳苑鄉","竹塘鄉","社頭鄉","二水鄉","田尾鄉","埤頭鄉","溪州鄉"],
  "南投縣": ["請選擇","南投市","草屯鎮","埔里鎮","集集鎮","竹山鎮","名間鄉","中寮鄉","國姓鄉","魚池鄉","水里鄉","鹿谷鄉","信義鄉","仁愛鄉"],
  "雲林縣": ["請選擇","斗六市","斗南鎮","大埤鄉","古坑鄉","林內鄉","莿桐鄉","虎尾鎮","土庫鎮","褒忠鄉","西螺鎮","二崙鄉","崙背鄉","麥寮鄉","臺西鄉","東勢鄉","北港鎮","元長鄉","四湖鄉","口湖鄉","水林鄉"],
  "嘉義市": ["請選擇","嘉義市"],
  "嘉義縣": ["請選擇","太保市","朴子市","布袋鎮","大林鎮","民雄鄉","溪口鄉","新港鄉","六腳鄉","東石鄉","義竹鄉","鹿草鄉","水上鄉","梅山鄉","竹崎鄉","番路鄉","中埔鄉","大埔鄉","阿里山鄉"],
  "屏東縣": ["請選擇","屏東市","潮州鎮","東港鎮","恆春鎮","高樹鄉","里港鄉","九如鄉","鹽埔鄉","長治鄉","麟洛鄉","萬丹鄉","內埔鄉","竹田鄉","新園鄉","萬巒鄉","新埤鄉","佳冬鄉","崁頂鄉","南州鄉","林邊鄉","枋寮鄉","枋山鄉","車城鄉","滿州鄉","琉球鄉","三地門鄉","霧台鄉","瑪家鄉","泰武鄉","來義鄉","春日鄉","獅子鄉","牡丹鄉"],
  "花蓮縣": ["請選擇","花蓮市","鳳林鎮","玉里鎮","新城鄉","吉安鄉","壽豐鄉","光復鄉","瑞穗鄉","富里鄉","豐濱鄉","秀林鄉","萬榮鄉","卓溪鄉"],
  "臺東縣": ["請選擇","臺東市","成功鎮","關山鎮","長濱鄉","東河鄉","池上鄉","鹿野鄉","卑南鄉","太麻里鄉","大武鄉","綠島鄉","海端鄉","延平鄉","金峰鄉","達仁鄉","蘭嶼鄉"],
  "澎湖縣": ["請選擇","馬公市","湖西鄉","白沙鄉","西嶼鄉","望安鄉","七美鄉"]    
};